fluxos-casos-uso.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-03-25 Tue 22:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Fluxos e Casos de Uso</title>
<meta name="description" content="Header" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Fluxos e Casos de Uso</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3cb87a7">Fluxo de Login</a>
<ul>
<li><a href="#org93ef8cb"><b><b>Fluxo Principal</b></b></a></li>
<li><a href="#org8fad0c6"><b><b>Fluxos Alternativos</b></b></a></li>
<li><a href="#orga416c46"><b><b>Design e Usabilidade</b></b></a></li>
</ul>
</li>
<li><a href="#org6f461b4">Fluxo de Cadastro de Funcionário</a>
<ul>
<li><a href="#orga1f2b87"><b><b>Fluxo Principal</b></b></a></li>
<li><a href="#org871c2ca"><b><b>Fluxos Alternativos</b></b></a></li>
<li><a href="#org4f9df68"><b><b>Design e Usabilidade</b></b></a></li>
</ul>
</li>
<li><a href="#org04a2bd5">Fluxo de Acesso ao Calendário</a>
<ul>
<li><a href="#orgc1fe671"><b><b>Fluxo Principal</b></b></a></li>
<li><a href="#org7867cc2"><b><b>Fluxos Alternativos</b></b></a></li>
<li><a href="#org57066de">Estrutura Geral</a></li>
<li><a href="#orgf4aa6de">Funcionalidades do Calendário</a></li>
<li><a href="#org9170671"><b><b>Design e Usabilidade</b></b></a></li>
</ul>
</li>
<li><a href="#org4c7ba8d">Fluxo de Navegação no Dashboard</a>
<ul>
<li><a href="#org4732320"><b><b>Fluxo Principal</b></b></a></li>
<li><a href="#orgb61a8e3"><b><b>Fluxos Alternativos</b></b></a></li>
<li><a href="#org7c265b2"><b><b>Design e Usabilidade</b></b></a></li>
</ul>
</li>
<li><a href="#org4d5c708">Fluxo de Chat</a>
<ul>
<li><a href="#org364dbff"><b><b>Fluxo Principal</b></b></a></li>
<li><a href="#org124112e"><b><b>Fluxos Alternativos</b></b></a></li>
<li><a href="#orga7b8a01"><b><b>Design e Usabilidade</b></b></a></li>
<li><a href="#orgf4fe2b1">Funcionalidades do Chat</a></li>
<li><a href="#orgdfd7892">Funcionalidades Extras do Chat</a></li>
</ul>
</li>
<li><a href="#orgcb1365d">Fluxo de Acesso à Área de Pagamentos</a>
<ul>
<li><a href="#org3c29d01"><b><b>Design e Usabilidade</b></b>:</a></li>
<li><a href="#org792e681"><b><b>Fluxos Alternativos</b></b>:</a></li>
</ul>
</li>
<li><a href="#org6eef5f3">Fluxo de Acesso à Página de Clientes</a>
<ul>
<li><a href="#org6fb3a2b"><b><b>Fluxos Alternativos</b></b>:</a></li>
</ul>
</li>
<li><a href="#org8cf864a">Funcionalidades do Perfil de Clientes</a></li>
<li><a href="#org9995113">Fluxo de E-mail</a></li>
<li><a href="#org91fdcaf">Fluxo da Página de Suporte</a>
<ul>
<li><a href="#org944957e"><b><b>Fluxos Alternativos</b></b>:</a></li>
</ul>
</li>
</ul>
</div>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="index.html">Home</a></td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b><b>Stack</b></b></td>
<td class="org-left"><b><b>Fluxos e Casos de Uso</b></b></td>
</tr>

<tr>
<td class="org-left"><a href="back-end.html">Back-End</a></td>
<td class="org-left"><a href="fluxos-casos-uso.html">Fluxos e Casos de Uso</a></td>
</tr>

<tr>
<td class="org-left"><a href="front-end.html">Front-End</a></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<div id="outline-container-org3cb87a7" class="outline-2">
<h2 id="org3cb87a7">Fluxo de Login</h2>
<div class="outline-text-2" id="text-org3cb87a7">
<p>
<b><b>Pré-condições</b></b>
</p>
<ul class="org-ul">
<li>O usuário acessa a página inicial do sistema.</li>
</ul>
</div>

<div id="outline-container-org93ef8cb" class="outline-3">
<h3 id="org93ef8cb"><b><b>Fluxo Principal</b></b></h3>
<div class="outline-text-3" id="text-org93ef8cb">
<ol class="org-ol">
<li>O sistema exibe a página de login com os seguintes elementos:
<ul class="org-ul">
<li><b><b>Logotipo HuzunSlug</b></b> posicionado no canto superior esquerdo.</li>
<li><b><b>Formulário de Login</b></b>:
<ul class="org-ul">
<li>Campo de <b><b>Nome de Usuário</b></b> com placeholder "Digite seu nome de usuário".</li>
<li>Campo de <b><b>Senha</b></b> com placeholder "Digite sua senha" e ícone para alternar a visibilidade da senha.</li>
<li><b><b>Checkbox "Lembre de mim"</b></b>: opção para manter o usuário logado.</li>
<li><b><b>Link "Esqueceu a senha?"</b></b> para recuperação de senha.</li>
<li><b><b>Botão "Login"</b></b>: Destacado em preto, para envio das credenciais.</li>
</ul></li>
</ul></li>

<li>O usuário preenche os campos com suas credenciais.</li>

<li>O usuário clica no botão <b><b>"Login"</b></b>.</li>

<li>O sistema realiza uma requisição HTTP para o endpoint de autenticação da API com as credenciais fornecidas.</li>

<li>A API valida as credenciais no banco de dados:
<ul class="org-ul">
<li>Se as credenciais forem válidas, a API retorna um <b><b>token de autenticação (JWT)</b></b>.</li>
<li>Se as credenciais forem inválidas, o sistema exibe uma mensagem de erro: "Credenciais inválidas".</li>
</ul></li>

<li>O sistema armazena o token de autenticação no <b><b>localStorage</b></b> ou <b><b>sessionStorage</b></b> do navegador.</li>

<li>O sistema redireciona o usuário para o painel correspondente ao seu perfil:
<ul class="org-ul">
<li><b><b>Administrador</b></b>: Acesso ao painel de configurações administrativas.</li>
<li><b><b>Funcionário</b></b>: Acesso ao painel de controle com recursos limitados.</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org8fad0c6" class="outline-3">
<h3 id="org8fad0c6"><b><b>Fluxos Alternativos</b></b></h3>
<div class="outline-text-3" id="text-org8fad0c6">
<ul class="org-ul">
<li><b><b>Esquecimento de senha</b></b>:
<ol class="org-ol">
<li>O usuário clica no link "Esqueceu a senha?".</li>
<li>O sistema solicita o e-mail do usuário.</li>
<li>O usuário recebe um e-mail com um link para redefinir a senha.</li>
</ol></li>

<li><b><b>Usuário já logado</b></b>:
<ol class="org-ol">
<li>Se o usuário já estiver logado, ele é redirecionado diretamente para o painel principal.</li>
</ol></li>
</ul>

<p>
<b><b>Fluxo de Exceção</b></b>
</p>

<ul class="org-ul">
<li>Se a API retornar um erro de rede ou falha na validação das credenciais, o sistema exibe uma mensagem de erro: "Erro na autenticação. Tente novamente."</li>
</ul>

<p>
<b><b>Pós-condições</b></b>
</p>
<ul class="org-ul">
<li>O usuário está autenticado e possui um token de autenticação válido armazenado no navegador.</li>
<li>O usuário é redirecionado para o painel correspondente ao seu perfil (Administrador ou Funcionário).</li>
</ul>
</div>
</div>

<div id="outline-container-orga416c46" class="outline-3">
<h3 id="orga416c46"><b><b>Design e Usabilidade</b></b></h3>
<div class="outline-text-3" id="text-orga416c46">
<ul class="org-ul">
<li><b><b>Estética e Layout</b></b>:
<ul class="org-ul">
<li>A interface possui um design clean e moderno com predominância de preto e branco.</li>
<li>Layout responsivo que se adapta a diferentes dispositivos (desktop, tablet, smartphone).</li>
<li>Ilustração interativa à direita da tela, tornando a interface mais convidativa e amigável.</li>
</ul></li>

<li><b><b>Acessibilidade e Usabilidade</b></b>:
<ul class="org-ul">
<li>O formulário de login é de fácil acesso e possui campos claramente identificados.</li>
<li>O ícone de alternância da senha oferece uma maneira intuitiva de visualizar a senha digitada.</li>
<li>O link para recuperação de senha é claramente visível e acessível.</li>
</ul></li>
</ul>

<p>
&#x2014;
</p>
</div>
</div>
</div>

<div id="outline-container-org6f461b4" class="outline-2">
<h2 id="org6f461b4">Fluxo de Cadastro de Funcionário</h2>
<div class="outline-text-2" id="text-org6f461b4">
<p>
<b><b>Pré-condições</b></b>
</p>
<ul class="org-ul">
<li>O administrador está autenticado e tem permissão para cadastrar funcionários.</li>
<li>O administrador acessa a tela de cadastro de funcionários a partir do dashboard (via sidebar ou menu).</li>
</ul>
</div>

<div id="outline-container-orga1f2b87" class="outline-3">
<h3 id="orga1f2b87"><b><b>Fluxo Principal</b></b></h3>
<div class="outline-text-3" id="text-orga1f2b87">
<ol class="org-ol">
<li>O sistema exibe a tela de cadastro com os seguintes campos obrigatórios:
<ul class="org-ul">
<li><b><b>Nome</b></b>: Campo de texto para inserir o nome completo do funcionário.</li>
<li><b><b>E-mail</b></b>: Campo de texto para o e-mail do funcionário.</li>
<li><b><b>Cargo</b></b>: Campo de seleção para escolher o cargo do funcionário.</li>
<li><b><b>Departamento</b></b>: Campo de seleção para escolher o departamento do funcionário.</li>
<li><b><b>Permissões</b></b>: Checkbox ou lista de seleção múltipla para atribuição de permissões (ex: calendário, relatórios, chats, pagamentos, etc.).</li>
</ul></li>

<li>O administrador preenche as informações do novo funcionário.</li>

<li>O administrador clica no botão <b><b>"Cadastrar"</b></b>.</li>

<li>O sistema realiza a validação das informações inseridas:
<ul class="org-ul">
<li><b><b>E-mail</b></b>: Verifica se o e-mail é válido e não está vazio.</li>
<li><b><b>Campos obrigatórios</b></b>: Verifica se todos os campos obrigatórios foram preenchidos.</li>
<li>Se algum dado obrigatório estiver ausente ou o formato for inválido, o sistema exibe uma mensagem de erro e destaca o campo incorreto.</li>
<li>Se os dados estiverem corretos, o sistema envia uma requisição HTTP para a API para salvar as informações no banco de dados.</li>
</ul></li>

<li>O sistema atribui permissões ao novo funcionário de acordo com o cargo e o perfil selecionado:
<ul class="org-ul">
<li>O administrador pode selecionar permissões para áreas como calendário, relatórios, chats, pagamentos, entre outras.</li>
</ul></li>

<li>O sistema registra o novo funcionário no banco de dados e envia um e-mail de boas-vindas ao funcionário com instruções de acesso inicial ao sistema.</li>

<li>O administrador é redirecionado para a <b><b>lista de funcionários</b></b> ou recebe uma mensagem de sucesso informando que o cadastro foi realizado com êxito.</li>
</ol>
</div>
</div>
