fluxos-casos-uso.html

<div id="outline-container-org871c2ca" class="outline-3">
<h3 id="org871c2ca"><b><b>Fluxos Alternativos</b></b></h3>
<div class="outline-text-3" id="text-org871c2ca">
<ul class="org-ul">
<li><b><b>E-mail já cadastrado</b></b>:
<ol class="org-ol">
<li>Se o e-mail do funcionário já estiver registrado no sistema, o sistema exibe uma mensagem de erro informando que o e-mail já existe.</li>
<li>O administrador pode optar por corrigir o e-mail ou cancelar o cadastro.</li>
</ol></li>
</ul>

<p>
<b><b>Fluxo de Exceção</b></b>
</p>

<ul class="org-ul">
<li><b><b>Falha na requisição para a API</b></b>:
<ol class="org-ol">
<li>Se ocorrer uma falha na comunicação com a API ou no salvamento dos dados, o sistema exibe uma mensagem de erro: "Erro ao cadastrar funcionário. Tente novamente."</li>
</ol></li>
</ul>

<p>
<b><b>Pós-condições</b></b>
</p>
<ul class="org-ul">
<li>O novo funcionário foi registrado no sistema com as permissões atribuídas e recebeu um e-mail de boas-vindas.</li>
<li>O administrador visualiza a lista de funcionários atualizada ou uma mensagem de sucesso confirmando o cadastro.</li>
</ul>
</div>
</div>

<div id="outline-container-org4f9df68" class="outline-3">
<h3 id="org4f9df68"><b><b>Design e Usabilidade</b></b></h3>
<div class="outline-text-3" id="text-org4f9df68">
<ul class="org-ul">
<li><b><b>Estética e Layout</b></b>:
<ul class="org-ul">
<li>O formulário possui uma estrutura limpa e intuitiva, com campos bem identificados.</li>
<li>O layout é responsivo, adaptando-se a diferentes tamanhos de tela (desktop, tablet, smartphone).</li>
</ul></li>

<li><b><b>Acessibilidade e Usabilidade</b></b>:
<ul class="org-ul">
<li>Validação de campos clara, com mensagens de erro visíveis ao lado dos campos com problemas.</li>
<li>Campos de seleção de permissões bem organizados para facilitar a atribuição de permissões.</li>
</ul></li>
</ul>

<p>
&#x2014;
</p>
</div>
</div>
</div>

<div id="outline-container-org04a2bd5" class="outline-2">
<h2 id="org04a2bd5">Fluxo de Acesso ao Calendário</h2>
<div class="outline-text-2" id="text-org04a2bd5">
<p>
<b><b>Pré-condições</b></b>
</p>
<ul class="org-ul">
<li>O funcionário está autenticado e tem permissão para acessar o calendário.</li>
<li>O administrador está autenticado e possui permissões para gerenciar calendários.</li>
</ul>
</div>

<div id="outline-container-orgc1fe671" class="outline-3">
<h3 id="orgc1fe671"><b><b>Fluxo Principal</b></b></h3>
<div class="outline-text-3" id="text-orgc1fe671">
<ol class="org-ol">
<li>O funcionário acessa a tela inicial (dashboard) e encontra o ícone do <b><b>Calendário</b></b> na sidebar.</li>

<li>O sistema exibe o calendário do funcionário, mostrando os compromissos e eventos do mês atual.</li>

<li>O funcionário pode adicionar novos compromissos, como reuniões ou tarefas, clicando em um dia específico no calendário.</li>

<li>Ao clicar em um dia, o sistema exibe um <b><b>modal</b></b> ou página onde o funcionário pode preencher os detalhes do evento, incluindo:
<ul class="org-ul">
<li>Nome do evento.</li>
<li>Hora de início e término.</li>
<li>Descrição do evento.</li>
<li>Local (opcional).</li>
<li>Links para videoconferência (se aplicável).</li>
</ul></li>

<li>O <b><b>administrador</b></b> pode acessar o calendário de qualquer funcionário ou grupo de funcionários:
<ul class="org-ul">
<li>O administrador acessa o calendário a partir da tela "Gerenciamento de Funcionários" ou "Calendário de Equipes".</li>
<li>O administrador tem acesso a todos os compromissos e eventos atribuídos aos funcionários ou grupos.</li>
</ul></li>

<li>O <b><b>administrador</b></b> pode adicionar ou editar compromissos no calendário de qualquer funcionário, com as mesmas funcionalidades de um funcionário regular (adicionar, editar e excluir eventos).</li>

<li>O funcionário ou administrador pode <b><b>editar ou excluir compromissos</b></b> diretamente no calendário.</li>
</ol>
</div>
</div>

<div id="outline-container-org7867cc2" class="outline-3">
<h3 id="org7867cc2"><b><b>Fluxos Alternativos</b></b></h3>
<div class="outline-text-3" id="text-org7867cc2">
<ul class="org-ul">
<li><b><b>Horário já ocupado</b></b>:
<ol class="org-ol">
<li>Caso o funcionário ou administrador tente adicionar um evento em um horário já ocupado, o sistema exibe uma mensagem de erro: "O horário selecionado está ocupado. Escolha outro horário."</li>
</ol></li>

<li><b><b>Permissão negada ao administrador</b></b>:
<ol class="org-ol">
<li>Se o administrador tentar editar o calendário de um funcionário sem permissões adequadas, o sistema exibe uma mensagem de erro: "Permissão negada para editar o calendário deste funcionário."</li>
</ol></li>
</ul>

<p>
<b><b>Fluxo de Exceção</b></b>
</p>

<ul class="org-ul">
<li><b><b>Erro ao salvar evento</b></b>:
<ol class="org-ol">
<li>Caso ocorra uma falha na comunicação com a API ou no salvamento de dados, o sistema exibe uma mensagem de erro: "Erro ao salvar o evento. Tente novamente."</li>
</ol></li>
</ul>

<p>
<b><b>Pós-condições</b></b>
</p>
<ul class="org-ul">
<li>O evento é salvo no calendário do funcionário ou grupo de funcionários.</li>
<li>O administrador tem acesso ao calendário atualizado e pode gerenciar compromissos conforme necessário.</li>
</ul>
</div>
</div>

<div id="outline-container-org57066de" class="outline-3">
<h3 id="org57066de">Estrutura Geral</h3>
<div class="outline-text-3" id="text-org57066de">
<p>
A tela do calendário está dividida em três seções principais:
</p>

<ol class="org-ol">
<li><b>Painel esquerdo (barra lateral)</b>:
<ul class="org-ul">
<li>Exibe um <b><b>mini calendário mensal</b></b> com os dias destacados.</li>
<li>Lista os <b><b>eventos do dia</b></b> e próximos compromissos.</li>
<li>Mostra detalhes como <b><b>temperatura</b></b> e previsões do tempo.</li>
<li>Inclui <b><b>atalhos</b></b> para adicionar eventos rapidamente.</li>
</ul></li>

<li><b>Área central (visualização do calendário)</b>:
<ul class="org-ul">
<li>Exibe os eventos em um formato de <b><b>agenda semanal</b></b>.</li>
<li>Permite alternar entre <b><b>visualizações diárias, semanais, mensais e anuais</b></b>.</li>
<li>Mostra compromissos organizados por horário e <b><b>cor para diferenciar categorias</b></b>.</li>
</ul></li>

<li><b>Barra superior</b>:
<ul class="org-ul">
<li>Contém <b><b>botões de navegação</b></b> entre datas.</li>
<li>Possui um <b><b>campo de busca</b></b> para encontrar eventos rapidamente.</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orgf4aa6de" class="outline-3">
<h3 id="orgf4aa6de">Funcionalidades do Calendário</h3>
<div class="outline-text-3" id="text-orgf4aa6de">
<ul class="org-ul">
<li><b><b>Criação e edição de eventos</b></b>: Adicionar novos compromissos rapidamente.</li>
<li><b><b>Integração com videoconferências</b></b>: Links diretos para reuniões online.</li>
<li><b><b>Categorização por cor</b></b>: Diferencia eventos por importância ou tipo.</li>
<li><b><b>Notificações e lembretes</b></b>: Alerta sobre reuniões futuras.</li>
<li><b><b>Eventos recorrentes</b></b>: Suporte para compromissos diários, semanais ou mensais.</li>
</ul>
</div>
</div>

<div id="outline-container-org9170671" class="outline-3">
<h3 id="org9170671"><b><b>Design e Usabilidade</b></b></h3>
<div class="outline-text-3" id="text-org9170671">
<ul class="org-ul">
<li><b><b>Interface clara e intuitiva</b></b>, com contraste suficiente para fácil leitura.</li>
<li><b><b>Cores distintas</b></b> ajudam a diferenciar tipos de eventos.</li>
<li><b><b>Modo escuro</b></b> no painel lateral, proporcionando melhor visibilidade.</li>
<li><b><b>Organização lógica e fluida</b></b>, permitindo rápida navegação e gerenciamento dos compromissos.</li>
<li><b><b>Responsividade</b></b> para diferentes tamanhos de tela e dispositivos.</li>
</ul>

<p>
&#x2014;
</p>
</div>
</div>
</div>

<div id="outline-container-org4c7ba8d" class="outline-2">
<h2 id="org4c7ba8d">Fluxo de Navegação no Dashboard</h2>
<div class="outline-text-2" id="text-org4c7ba8d">
<p>
<b><b>Pré-condições</b></b>
</p>
<ul class="org-ul">
<li>O funcionário está autenticado e tem acesso ao dashboard.</li>
</ul>
</div>
