fluxos-casos-uso.html

<div id="outline-container-org4732320" class="outline-3">
<h3 id="org4732320"><b><b>Fluxo Principal</b></b></h3>
<div class="outline-text-3" id="text-org4732320">
<ol class="org-ol">
<li>O funcionário acessa a tela inicial (dashboard) após fazer login.</li>

<li>O sistema exibe a tela inicial com as seguintes opções no menu lateral (sidebar):
<ul class="org-ul">
<li><b><b>Dashboard (ativo)</b></b>: Exibe um resumo geral das métricas e dados.</li>
<li><b><b>Calendário</b></b>: Acesso ao calendário pessoal e eventos.</li>
<li><b><b>E-mail</b></b>: Acesso à caixa de entrada de e-mails.</li>
<li><b><b>Área de Pagamentos</b></b>: Acesso à página de históricos de pagamentos.</li>
<li><b><b>Clientes</b></b>: Acesso à lista de clientes da empresa e seus detalhes.</li>
<li><b><b>Raids</b></b>: Acesso ao sistema de gestão de raids (caso exista).</li>
<li><b><b>Chat</b></b>: Acesso ao chat de equipe para comunicação interna.</li>
<li><b><b>Campanhas</b></b>: Acesso a campanhas de marketing ou vendas.</li>
<li><b><b>Tela de Serviços</b></b>: Acesso a serviços ou funcionalidades adicionais.</li>
<li><b><b>Flow</b></b>: Acesso ao editor de fluxos de automação.</li>
<li><b><b>Suporte e Configurações</b></b>: Acesso ao suporte e às configurações do sistema.</li>
</ul></li>

<li>Além disso, o dashboard exibe as seguintes seções e widgets informativos:
<ul class="org-ul">
<li><b><b>📊 Seção de Resultados Finais</b></b>: Gráfico de barras mensais com métricas de desempenho.</li>
<li><b><b>📆 Mini Calendário</b></b>: Exibe um calendário pequeno com os eventos do mês atual.</li>
<li><b><b>📞 Chamados Abertos</b></b>: Exibe o número de chamados abertos e em fila para atendimento.</li>
<li><b><b>💰 Lucro Líquido</b></b>: Exibe o lucro do mês ou do período selecionado, com comparações de crescimento.</li>
<li><b><b>🔥 Mapa de Calor</b></b>: Representa a densidade de atividade ao longo da semana e do dia.</li>
<li><b><b>🖥 Lista de Funcionários Online</b></b>: Mostra quais funcionários estão online no sistema no momento.</li>
</ul></li>

<li>O funcionário pode acessar qualquer uma dessas áreas clicando nas opções da sidebar.</li>

<li>O sistema atualiza as seções e widgets conforme o funcionário interage com o dashboard, exibindo informações em tempo real ou conforme a configuração de atualizações.</li>
</ol>
</div>
</div>

<div id="outline-container-orgb61a8e3" class="outline-3">
<h3 id="orgb61a8e3"><b><b>Fluxos Alternativos</b></b></h3>
<div class="outline-text-3" id="text-orgb61a8e3">
<ul class="org-ul">
<li><b><b>Acesso Restrito</b></b>:
<ol class="org-ol">
<li>Caso o funcionário não tenha permissões para acessar determinada área (ex: área de pagamento), ele verá uma mensagem de erro: "Acesso Restrito". O sistema impedirá o acesso à página solicitada.</li>
</ol></li>

<li><b><b>Falha de Conexão</b></b>:
<ol class="org-ol">
<li>Caso o sistema detecte uma falha de conexão, será exibida a mensagem: "Conexão Perdida".</li>
<li>O sistema tentará reconectar automaticamente ou fornecerá a opção para o usuário tentar novamente.</li>
</ol></li>
</ul>

<p>
<b><b>Recursos Extras</b></b>
</p>

<ul class="org-ul">
<li><b><b>Botão de Calendário e Perfil</b></b>: Localizado no canto superior direito, permite ao usuário acessar configurações pessoais, como preferências de calendário e perfil.</li>

<li><b><b>Campo de Busca</b></b>: O funcionário pode usar o campo de busca para encontrar dados rapidamente no sistema. Ele pode pesquisar por eventos, funcionários, ou informações relacionadas às métricas do dashboard.</li>

<li><b><b>Filtros</b></b>: O sistema oferece filtros personalizados para exibição de dados. O funcionário pode ajustar os filtros de tempo, tipo de evento, e outros parâmetros para exibir informações específicas e facilitar a análise.</li>
</ul>

<p>
<b><b>Pós-condições</b></b>
</p>
<ul class="org-ul">
<li>O funcionário tem acesso completo às áreas do dashboard conforme suas permissões.</li>
<li>As seções e widgets do dashboard são atualizados em tempo real ou conforme configurado.</li>
</ul>
</div>
</div>

<div id="outline-container-org7c265b2" class="outline-3">
<h3 id="org7c265b2"><b><b>Design e Usabilidade</b></b></h3>
<div class="outline-text-3" id="text-org7c265b2">
<ul class="org-ul">
<li><b><b>Interface clara e limpa</b></b>: O layout da sidebar e do dashboard é intuitivo, com contraste adequado para fácil leitura.</li>
<li><b><b>Organização lógica</b></b>: As opções do menu lateral são divididas por categorias e são facilmente acessíveis.</li>
<li><b><b>Responsividade</b></b>: O dashboard se adapta a diferentes dispositivos, garantindo usabilidade em desktops, tablets e smartphones.</li>
<li><b><b>Acessibilidade</b></b>: Elementos interativos como botões, campos de busca e widgets têm indicadores visuais claros para interatividade.</li>
</ul>

<p>
&#x2014;
</p>
</div>
</div>
</div>

<div id="outline-container-org4d5c708" class="outline-2">
<h2 id="org4d5c708">Fluxo de Chat</h2>
<div class="outline-text-2" id="text-org4d5c708">
<p>
<b><b>Pré-condições</b></b>
</p>
<ul class="org-ul">
<li>O usuário está autenticado e tem acesso à área de chat.</li>
</ul>
</div>

<div id="outline-container-org364dbff" class="outline-3">
<h3 id="org364dbff"><b><b>Fluxo Principal</b></b></h3>
<div class="outline-text-3" id="text-org364dbff">
<ol class="org-ol">
<li>O usuário acessa o <b><b>Chat</b></b> através da sidebar no dashboard.</li>

<li>O sistema exibe a interface de chat organizada da seguinte forma:
<ul class="org-ul">
<li><b><b>Sidebar Esquerda</b></b>: Menu de navegação com acesso aos seguintes módulos:
<ul class="org-ul">
<li><b><b>Dashboard</b></b>: Exibe o resumo geral das métricas e dados.</li>
<li><b><b>E-mail</b></b>: Acesso à caixa de entrada de e-mails.</li>
<li><b><b>Pagamentos</b></b>: Acesso aos históricos de pagamentos.</li>
<li><b><b>Clientes</b></b>: Acesso à lista de clientes e seus detalhes.</li>
<li><b><b>Raids</b></b>: Acesso ao sistema de gestão de raids.</li>
<li><b><b>Team Chat</b></b>: Acesso ao chat de equipe, onde as conversas internas acontecem.</li>
<li><b><b>Campanhas</b></b>: Acesso às campanhas de marketing ou vendas.</li>
<li><b><b>Tela de Serviços</b></b>: Acesso a serviços ou funcionalidades adicionais.</li>
<li><b><b>Calendário</b></b>: Acesso ao calendário de compromissos e eventos.</li>
<li><b><b>Flow</b></b>: Acesso ao editor de fluxos de automação.</li>
</ul></li>

<li><b><b>Área de Mensagens</b></b>: Exibe uma lista de conversas recentes, com as seguintes informações:
<ul class="org-ul">
<li><b><b>Nome</b></b> do contato ou grupo.</li>
<li><b><b>Última mensagem</b></b> enviada.</li>
<li><b><b>Horário</b></b> da última mensagem.</li>
<li><b><b>Ícones indicativos</b></b> de status, como reações, chamadas perdidas, mensagens não lidas, entre outros.</li>
</ul></li>

<li><b><b>Área de Chat</b></b>: Exibe a janela central onde as mensagens entre os participantes são trocadas. A janela de chat inclui:
<ul class="org-ul">
<li><b><b>Campo de digitação</b></b> para inserir mensagens.</li>
<li><b><b>Botões de envio</b></b>: Envio de texto e outros tipos de mensagem, como emojis, arquivos ou links.</li>
<li><b><b>Histórico de mensagens</b></b>: Exibe o histórico de mensagens trocadas entre os participantes.</li>
</ul></li>
</ul></li>

<li>O usuário pode selecionar uma conversa na <b><b>Área de Mensagens</b></b> para abrir a conversa desejada na <b><b>Área de Chat</b></b>.</li>

<li>O usuário digita a mensagem e clica no botão <b><b>"Enviar"</b></b> para enviar a mensagem ao contato ou grupo selecionado.</li>

<li>O sistema atualiza a <b><b>Área de Mensagens</b></b> com a última mensagem enviada e a exibe na <b><b>Área de Chat</b></b>.</li>
</ol>
</div>
</div>
