fluxos-casos-uso.html

<div id="outline-container-org6eef5f3" class="outline-2">
<h2 id="org6eef5f3">Fluxo de Acesso à Página de Clientes</h2>
<div class="outline-text-2" id="text-org6eef5f3">
<ol class="org-ol">
<li>O usuário acessa a página de <b><b>Clientes</b></b> através do menu lateral no Dashboard.</li>
<li>O sistema exibe duas seções principais:
<ul class="org-ul">
<li><b><b>Lista de Clientes</b></b> à esquerda, com detalhes como nome, status, contato e tags.</li>
<li><b><b>Perfil Detalhado do Cliente</b></b> à direita, exibindo informações pessoais e médicas.</li>
</ul></li>
<li>Na <b><b>barra superior</b></b>, são apresentadas ações rápidas, incluindo:
<ul class="org-ul">
<li><b><b>Busca</b></b> de clientes.</li>
<li><b><b>Exportação de dados</b></b> em CSV.</li>
<li><b><b>Adição de novos clientes</b></b>.</li>
</ul></li>
</ol>
</div>

<div id="outline-container-org6fb3a2b" class="outline-3">
<h3 id="org6fb3a2b"><b><b>Fluxos Alternativos</b></b>:</h3>
<div class="outline-text-3" id="text-org6fb3a2b">
<ul class="org-ul">
<li>Caso o usuário não tenha permissões para acessar a página de clientes, o sistema exibirá uma mensagem de "Acesso Negado".</li>
</ul>

<p>
&#x2014;
</p>
</div>
</div>
</div>

<div id="outline-container-org8cf864a" class="outline-2">
<h2 id="org8cf864a">Funcionalidades do Perfil de Clientes</h2>
<div class="outline-text-2" id="text-org8cf864a">
<p>
<b><b>Lista de Clientes</b></b>:
</p>

<ol class="org-ol">
<li>Exibição de <b><b>clientes</b></b> com informações como:
<ul class="org-ul">
<li><b><b>Status</b></b>: (Ativo, Inativo, etc.)</li>
<li><b><b>Contato</b></b>: telefone e e-mail.</li>
<li><b><b>Tags</b></b>: Etiquetas para classificar clientes (ex: "Alto risco", "Urgente").</li>
</ul></li>
<li>Opção para <b><b>selecionar todos os clientes</b></b> e realizar ações em massa (ex: exportar dados ou alterar status).</li>
<li><b><b>Ícones de Edição</b></b>: Permite modificar informações de clientes diretamente na lista.</li>
<li><b><b>Botões de Ação Rápida</b></b>:
<ul class="org-ul">
<li><b><b>Busca</b></b>: Pesquisa de clientes por nome ou e-mail.</li>
<li><b><b>Exportação de Dados</b></b>: Exporta a lista de clientes em formato CSV.</li>
</ul></li>
</ol>

<p>
<b><b>Perfil Individual do Cliente</b></b>:
</p>

<ol class="org-ol">
<li><b><b>Foto de Perfil e Nome</b></b>: Exibe a imagem do cliente e nome completo.</li>
<li><b><b>Informações de Contato</b></b>: Inclui telefone, e-mail e opções de edição.</li>
<li><b><b>Dados Médicos</b></b>: Organizados por categorias:
<ul class="org-ul">
<li><b><b>Encontros</b></b>: Registro de visitas e consultas anteriores.</li>
<li><b><b>Medicamentos</b></b>: Lista de medicamentos prescritos.</li>
<li><b><b>Alergias</b></b>: Informações sobre alergias e reações.</li>
<li><b><b>Histórico Médico</b></b>: Relatos médicos importantes ou históricos.</li>
<li><b><b>Notas</b></b>: Espaço para o profissional adicionar anotações.</li>
</ul></li>
<li><b><b>Próxima Consulta</b></b>: A próxima consulta é destacada com data e horário.</li>
<li><b><b>Condições Ativas</b></b>: Exibição de condições médicas ativas do cliente, como hipertensão, diabetes, dermatite, etc., com etiquetas indicativas.</li>
</ol>

<p>
&#x2014;
</p>
</div>
</div>

<div id="outline-container-org9995113" class="outline-2">
<h2 id="org9995113">Fluxo de E-mail</h2>
<div class="outline-text-2" id="text-org9995113">
<ol class="org-ol">
<li>O usuário acessa a página de <b><b>E-mail</b></b> a partir do dashboard.</li>
<li>A interface de e-mail é dividida em:
<ul class="org-ul">
<li><b><b>Menu lateral esquerdo</b></b> com categorias: Caixa de Entrada, Comerciais, Enviados, Spam, Lixeira e Rascunhos.</li>
<li><b><b>Lista de E-mails</b></b> exibindo detalhes como remetente, assunto, status de leitura e horário.</li>
<li><b><b>Painel de Leitura de E-mails</b></b> à direita, com mensagens organizadas por conversas (threads).</li>
<li><b><b>Barra Superior de Ações</b></b>, incluindo respostas, encaminhamento, arquivamento e pesquisa.</li>
</ul></li>
</ol>

<p>
<b><b>Funcionalidades</b></b>:
</p>
<ul class="org-ul">
<li>Organização de e-mails por status de leitura e categorias.</li>
<li>Opção de <b><b>marcar como lido/não lido</b></b>, <b><b>mover e-mails para pastas</b></b>.</li>
<li>Respostas e encaminhamentos rápidos.</li>
<li><b><b>Barra de pesquisa</b></b> para localização rápida de e-mails.</li>
</ul>

<p>
&#x2014;
</p>
</div>
</div>

<div id="outline-container-org91fdcaf" class="outline-2">
<h2 id="org91fdcaf">Fluxo da Página de Suporte</h2>
<div class="outline-text-2" id="text-org91fdcaf">
<ol class="org-ol">
<li>O usuário acessa a tela de suporte a partir do menu lateral no dashboard ou pelo acesso direto.</li>
<li>O sistema exibe a tela de suporte organizada em três áreas principais:
<ul class="org-ul">
<li><b><b>Painel Lateral Esquerdo</b></b>: Contém a marca "HuzunSlug" no topo, um campo de busca para localizar funcionalidades rapidamente e uma lista de seções (Dashboard, Email, Pagamentos, Clientes, Raids, Team Chat, Campanhas, Tela de serviços, Calendário, Flow).</li>
<li><b><b>Área Central</b></b>: Exibe a interface do chatbot inteligente, com a mensagem "Olá, sou o Vanguard. Como posso ajudar hoje?".</li>
<li><b><b>Campo de Entrada de Texto</b></b>: Localizado na parte inferior da tela, permitindo ao usuário digitar perguntas para o suporte e enviar arquivos através de um ícone de anexo.</li>
</ul></li>

<li>O usuário pode interagir com o <b><b>chatbot inteligente</b></b>, chamado "Vanguard", para obter respostas rápidas.</li>
<li>O <b><b>campo de busca</b></b> permite que o usuário encontre rapidamente funcionalidades ou informações dentro da plataforma.</li>
<li>Caso o usuário precise enviar mais informações, ele pode <b><b>anexar arquivos</b></b> através do ícone de anexo no campo de entrada de texto.</li>
<li>O painel lateral oferece uma navegação rápida para outras áreas da plataforma, como o <b><b>Dashboard</b></b>, <b><b>E-mail</b></b>, <b><b>Pagamentos</b></b>, <b><b>Clientes</b></b>, <b><b>Raids</b></b>, <b><b>Team Chat</b></b>, <b><b>Campanhas</b></b>, <b><b>Tela de Serviços</b></b>, <b><b>Calendário</b></b> e <b><b>Flow</b></b>.</li>
</ol>
</div>

<div id="outline-container-org944957e" class="outline-3">
<h3 id="org944957e"><b><b>Fluxos Alternativos</b></b>:</h3>
<div class="outline-text-3" id="text-org944957e">
<ul class="org-ul">
<li>Caso o chatbot não consiga fornecer uma resposta adequada, ele poderá direcionar o usuário para o suporte humano ou fornecer uma mensagem de "Solicitação registrada, entraremos em contato em breve".</li>
<li>Se o usuário não encontrar o que procura no campo de busca, será possível realizar uma pesquisa mais detalhada ou obter ajuda do suporte via chatbot.</li>
</ul>

<p>
<b><b>Recursos Extras</b></b>:
</p>
<ul class="org-ul">
<li><b><b>Botões de navegação</b></b> no painel lateral para acesso rápido às outras funcionalidades.</li>
<li><b><b>Possibilidade de anexar arquivos</b></b> para dar mais contexto ao pedido de suporte.</li>
</ul>

<p>
&#x2014;
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2025-03-25 Tue 22:17</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
